#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.always_run: Refreshing state... [id=8132057682261003212]
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=726099b53168c8bf93aab0585c5f2776c3fd34f2]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=6851962395169048481]
proxmox_lxc.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-polaris/lxc/2005]
proxmox_lxc.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-carina/lxc/2004]
proxmox_vm_qemu.k3s-manager-controller-3: Refreshing state... [id=milky-polaris/qemu/10002]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]
proxmox_vm_qemu.k3s-manager-worker-1: Refreshing state... [id=milky-capella/qemu/11000]
proxmox_vm_qemu.k3s-manager-worker-2: Refreshing state... [id=milky-polaris/qemu/11001]
proxmox_vm_qemu.k3s-manager-controller-2: Refreshing state... [id=milky-carina/qemu/10001]
proxmox_vm_qemu.k3s-manager-controller-1: Refreshing state... [id=milky-capella/qemu/10000]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-carina/qemu/2006]
proxmox_vm_qemu.k3s-manager-worker-3: Refreshing state... [id=milky-carina/qemu/11002]
proxmox_lxc.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/lxc/2003]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "8132057682261003212" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2025-01-05T15:19:58Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "6851962395169048481" -> (known after apply)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-1" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-capella/lxc/2003"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-2" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-carina/lxc/2004"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/2005"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-1 will be created
  + resource "proxmox_lxc" "k3s-lb-1" {
      + arch            = "amd64"
      + clone           = "9100"
      + cmode           = "tty"
      + console         = true
      + cores           = 1
      + cpulimit        = 0
      + cpuunits        = 1024
      + description     = "Management Kubernetes Cluster LoadBalancer"
      + hostname        = "solufit-k3s-lb-1"
      + id              = (known after apply)
      + memory          = 256
      + onboot          = true
      + ostype          = (known after apply)
      + pool            = "solufit"
      + protection      = false
      + ssh_public_keys = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + start           = true
      + swap            = 0
      + tags            = (known after apply)
      + target_node     = "milky-capella"
      + tty             = 2
      + unprivileged    = false
      + unused          = (known after apply)
      + vmid            = 12001

      + network {
          + bridge   = "k3s"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "10.100.0.5/24"
          + mtu      = 1400
          + name     = "eth0"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr2"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "dhcp"
          + mtu      = 1400
          + name     = "eth1"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }

      + rootfs {
          + size    = "8G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

  # proxmox_lxc.k3s-lb-2 will be created
  + resource "proxmox_lxc" "k3s-lb-2" {
      + arch            = "amd64"
      + clone           = "9101"
      + cmode           = "tty"
      + console         = true
      + cores           = 1
      + cpulimit        = 0
      + cpuunits        = 1024
      + description     = "Management Kubernetes Cluster LoadBalancer"
      + hostname        = "solufit-k3s-lb-2"
      + id              = (known after apply)
      + memory          = 256
      + onboot          = true
      + ostype          = (known after apply)
      + pool            = "solufit"
      + protection      = false
      + ssh_public_keys = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + start           = true
      + swap            = 0
      + tags            = (known after apply)
      + target_node     = "milky-carina"
      + tty             = 2
      + unprivileged    = false
      + unused          = (known after apply)
      + vmid            = 12002

      + network {
          + bridge   = "k3s"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "10.100.0.6/24"
          + mtu      = 1400
          + name     = "eth0"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr2"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "dhcp"
          + mtu      = 1400
          + name     = "eth1"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }

      + rootfs {
          + size    = "8G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

  # proxmox_lxc.k3s-lb-3 will be created
  + resource "proxmox_lxc" "k3s-lb-3" {
      + arch            = "amd64"
      + clone           = "9102"
      + cmode           = "tty"
      + console         = true
      + cores           = 1
      + cpulimit        = 0
      + cpuunits        = 1024
      + description     = "Management Kubernetes Cluster LoadBalancer"
      + hostname        = "solufit-k3s-lb-3"
      + id              = (known after apply)
      + memory          = 256
      + onboot          = true
      + ostype          = (known after apply)
      + pool            = "solufit"
      + protection      = false
      + ssh_public_keys = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + start           = true
      + swap            = 0
      + tags            = (known after apply)
      + target_node     = "milky-capella"
      + tty             = 2
      + unprivileged    = false
      + unused          = (known after apply)
      + vmid            = 12002

      + network {
          + bridge   = "k3s"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "10.100.0.7/24"
          + mtu      = 1400
          + name     = "eth0"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr2"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "dhcp"
          + mtu      = 1400
          + name     = "eth1"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }

      + rootfs {
          + size    = "8G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      ~ agent                  = 0 -> 1
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
      ~ cores                  = 8 -> 4
        id                     = "milky-capella/qemu/10000"
      ~ memory                 = 8196 -> 4096
        name                   = "solufit-k3s-controller-1"
        tags                   = null
        # (64 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      ~ agent                  = 0 -> 1
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/10001"
        name                   = "solufit-k3s-controller-2"
        tags                   = null
        # (66 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      ~ agent                  = 0 -> 1
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/10002"
        name                   = "solufit-k3s-controller-3"
        tags                   = null
        # (66 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      ~ agent                  = 0 -> 1
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/11000"
        name                   = "solufit-k3s-worker-1"
        tags                   = null
        # (66 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      ~ agent                  = 0 -> 1
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/11001"
        name                   = "solufit-k3s-worker-2"
        tags                   = null
        # (66 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      ~ agent                  = 0 -> 1
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/11002"
        name                   = "solufit-k3s-worker-3"
        tags                   = null
        # (66 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 11 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*